'''
По введенным пользователем координатам двух точек вывести уравнение прямой, проходящей через эти точки.
'''

x1 = int(input("Введите координату Х первой точки: "))
y1 = int(input("Введите координату Y первой точки: "))
x2 = int(input("Введите координату Х второй точки: "))
y2 = int(input("Введите координату Y второй точки: "))

a = y1 - y2
b = x2 - x1
c = x1 * y2 - x2 * y1

if a == 0: a = ""
else: a = str(a)+"x"

if b < 0: b = " - "+str(-b)+"y"
elif a == 0: a = ""
else: b = " + "+str(b)+"y"

if c < 0: c = " - " + str(-c)
elif c == 0: c = ""
else: c = " + "+str(c)

print("Уравнение прямой: " + a + b + c + " = 0")
#
