'''
6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
'''

a = int(input('Введите номер латинской буквы от 1 до 26: '))
print('Это буква',chr(a+96))
#